/*水仙花数”是指一个 n 位正整数（n≥3），它的每个位上的数字的 n 次幂之和等于它本身。最常见的是 3 位数的水仙花数 
输入包含多组测试数据。第一行包含一个整数 T ( 1 ≤ T ≤ 105 ），表示测试数据组数。
第一行包含两个整数 l , r ( 100 ≤ l , r ≤ 109 ) , 表示初始编号和终止编号。编号是连续的整数，即编号范围为 l ~ r 。
对于每组数据，输出一个整数，表示这一批材料有多少编号为水仙花数的材料。*/

#include <bits/stdc++.h>
using namespace std;

int main () {
    int num[22] = {153, 370, 371, 407, 1634, 8208, 9474, 54748, 92727, 93084, 548834, 1741725, 4210818, 9800817, 9926315, 24678050, 24678051, 88593477, 146511208, 472335975, 534494836, 912985153};
    int t, l, r;
    cin >> t;
    for (; t>0; t--) {
        cin >> l >> r;
        int count = 0;
        for (int i=0; i<22; i++) {
            if (num[i] >= l && num[i] <= r)
                count ++;
        }
        cout << count << endl;
    }

    return 0;

}